'use strict';
/*----------------------------------------------------------------------------------------------------------------------
 Клас служить для зчитування одного ключа з пристрою, збереження його в собі та видачу результату на підставі вказаної механіки.
 key - Ключ Modbus який буде надісланий у запиті і значення якого в оригінальному вигляді буде зберігати об'єкт.
 obj_id - ідентифікатор об'єкту по його значенню (Клас не має фізичного елементу на html сторінці)
 method - метод, який буде виконаний відразу після ініціалізації об'єкту класу (отримвння значення)
 target_id - Ідентифікатор об'єкту, класу StaticSpan, який ініціалізується


              !!!!!!!!!!!!!! Класс не використовується. !!!!!!!!!!!!!!!!!!!!!!!
 ----------------------------------------------------------------------------------------------------------------------*/
class ValueFromDevice {
    constructor (key, obj_id, method='', target_id) {
        if (key === '') key = 'RelayName';
        this.key = key;
        this.objectid = obj_id;
        this.value = null;
        this.method = method;
        this.target = target_id;
        requestOriginValue(this);
    }

    initValue(value) {
        this.value = value;
        console.log('Збереження значення [' +  value + "] в об'єкті " + this.objectid);
        this.getValue(value);
    }

    reinit() { /* Заглушка для стандартизації */ }

    save() { /* Заглушка для стандартизації */ }

    getValue() {

    }
} // Кінець класу ValueFromDevice
